Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Left_input (InputLayer)         [(None, 64, 64, 3)]  0                                            
__________________________________________________________________________________________________
Right_input (InputLayer)        [(None, 64, 64, 3)]  0                                            
__________________________________________________________________________________________________
Branch_model (Model)            (None, 8, 8, 48)     450576      Left_input[0][0]                 
                                                                 Right_input[0][0]                
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 3072)         0           Branch_model[1][0]               
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 8, 8, 96)     0           Branch_model[1][0]               
                                                                 Branch_model[2][0]               
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 3072)         0           Branch_model[2][0]               
__________________________________________________________________________________________________
Left_dense0 (Dense)             (None, 512)          1573376     flatten_1[0][0]                  
__________________________________________________________________________________________________
Trunk_model (Model)             (None, 128)          930304      concatenate_8[0][0]              
__________________________________________________________________________________________________
Right_dense0 (Dense)            (None, 512)          1573376     flatten_2[0][0]                  
__________________________________________________________________________________________________
Left_branch_classification (Den (None, 195)          100035      Left_dense0[0][0]                
__________________________________________________________________________________________________
Siamese_classification (Dense)  (None, 1)            129         Trunk_model[1][0]                
__________________________________________________________________________________________________
Right_branch_classification (De (None, 195)          100035      Right_dense0[0][0]               
==================================================================================================
Total params: 4,727,831
Trainable params: 4,727,831
Non-trainable params: 0
__________________________________________________________________________________________________
